API/GetFlight_API/Report/Res1/Report/Data/Step2.js

function _get_dyn_external_content_for_st(){return '<div><style>.basic-block table td.no-border{padding-left:0;}</style><div class="st-act-wrapper "><div class="block basic-block"><table><tr><td class="name col-head-style">Name</td><td class="name col-head-style">Step ID</td><td class="name col-head-style">Status</td><td class="name col-head-style">Message</td></tr><tr><td class="value col-head-style">GetFlights</td><td class="value col-head-style">StServiceCallActivity4</td><td class="value col-head-style">Done</td><td class="value col-head-style">Web service call performed successfully</td></tr></table></div><div class="block other-props-block"><div class="block-title">More</div><table><tr><td class="name row-head-style">InputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_InputXml_bd2b0bfb-3596-4f6c-8280-d9930963fd16.xml\', \'Data/StServiceCallActivity4_InputXml_bd2b0bfb-3596-4f6c-8280-d9930963fd16-js4hrpt.js\', \'.xml\', \'InputXml\');return false;">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;Body&gt;\r\n    &lt;GetFlights xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n      &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n      &lt;FlightDate&gt;2025-12-31T00:00:00+00:00&lt;/FlightDate&gt;\r\n    &lt;/GetFlights&gt;\r\n  &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Service</td><td class="value row-head-style">Flights_Service</td></tr><tr><td class="name row-head-style">Port</td><td class="value row-head-style">FlightsServiceMethods</td></tr><tr><td class="name row-head-style">Operation</td><td class="value row-head-style">GetFlights</td></tr><tr><td class="name row-head-style">Address</td><td class="value row-head-style">http://localhost:8000/Flights_SOAP</td></tr><tr><td class="name row-head-style">SOAPAction</td><td class="value row-head-style">HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights</td></tr><tr><td class="name row-head-style">ContentType</td><td class="value row-head-style">text/xml; charset=utf-8</td></tr><tr><td class="name row-head-style">MessageExchangePattern</td><td class="value row-head-style">Request Response</td></tr><tr><td class="name row-head-style">Full request</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_Full_request_3fdaf52c-4716-43c7-b2a9-e67afc25aade.xml\', \'Data/StServiceCallActivity4_Full_request_3fdaf52c-4716-43c7-b2a9-e67afc25aade-js4hrpt.js\', \'.xml\', \'Full request\');return false;">&lt;?xml version="1.0"? ... &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">InputHeader</td><td class="value row-head-style">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights\nContent-Type:	text/xml; charset=utf-8\nHost:	localhost:8000\nContent-Length:	260\nConnection:	Close\n</td></tr><tr><td class="name row-head-style">OutputHeader</td><td class="value row-head-style">Connection:	close\nContent-Length:	3364\nContent-Type:	text/xml; charset=utf-8\nDate:	Mon, 12 May 2025 13:28:40 GMT\nServer:	Microsoft-HTTPAPI/2.0\n</td></tr><tr><td class="name row-head-style">OutputText</td><td class="value row-head-style">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:06 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;10:09 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;2880&lt;/FlightNumber&gt;&lt;Price&gt;134.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;02:43 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;01:45 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3019&lt;/FlightNumber&gt;&lt;Price&gt;124&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;07:31 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;06:33 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;3740&lt;/FlightNumber&gt;&lt;Price&gt;126.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;03:55 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;02:57 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;4661&lt;/FlightNumber&gt;&lt;Price&gt;107.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;12:18 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;11:21 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;4777&lt;/FlightNumber&gt;&lt;Price&gt;110.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:31 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:33 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6142&lt;/FlightNumber&gt;&lt;Price&gt;121.2&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:30 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;10:10 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6305&lt;/FlightNumber&gt;&lt;Price&gt;295&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;UA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;02:50 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;11:30 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6306&lt;/FlightNumber&gt;&lt;Price&gt;255&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;UA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;05:00 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;01:00 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6307&lt;/FlightNumber&gt;&lt;Price&gt;245&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;06:00 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:00 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6308&lt;/FlightNumber&gt;&lt;Price&gt;230&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;10:30 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;07:00 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;6309&lt;/FlightNumber&gt;&lt;Price&gt;199&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;05:07 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;04:09 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;7574&lt;/FlightNumber&gt;&lt;Price&gt;136&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;TWA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:42 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;07:45 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;8649&lt;/FlightNumber&gt;&lt;Price&gt;134.4&lt;/Price&gt;&lt;/Flight&gt;&lt;/GetFlightsResult&gt;&lt;/GetFlightsResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</td></tr><tr><td class="name row-head-style">HttpStatusCode</td><td class="value row-head-style">200 : OK</td></tr><tr><td class="name row-head-style">OutputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity4_OutputXml_4be289da-5308-4cce-8340-0ad2a1d02887.xml\', \'Data/StServiceCallActivity4_OutputXml_4be289da-5308-4cce-8340-0ad2a1d02887-js4hrpt.js\', \'.xml\', \'OutputXml\');return false;">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;s:Body&gt;\r\n    &lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;11:06 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;10:09 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;2880&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;134.8&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;02:43 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;01:45 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;3019&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;124&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;07:31 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;06:33 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;3740&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;126.8&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;03:55 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;02:57 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;4661&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;107.2&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;12:18 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;11:21 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;4777&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;110.8&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;01:31 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;12:33 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6142&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;121.2&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;01:30 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;10:10 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6305&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;295&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;UA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;02:50 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;11:30 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6306&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;255&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;UA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;05:00 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;01:00 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6307&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;245&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;06:00 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;03:00 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6308&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;230&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;AA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;10:30 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;07:00 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;6309&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;199&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;05:07 PM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;04:09 PM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;7574&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;136&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n        &lt;Flight&gt;\r\n          &lt;Airline&gt;TWA&lt;/Airline&gt;\r\n          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;\r\n          &lt;ArrivalTime&gt;08:42 AM&lt;/ArrivalTime&gt;\r\n          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;\r\n          &lt;DepartureTime&gt;07:45 AM&lt;/DepartureTime&gt;\r\n          &lt;FlightNumber&gt;8649&lt;/FlightNumber&gt;\r\n          &lt;Price&gt;134.4&lt;/Price&gt;\r\n        &lt;/Flight&gt;\r\n      &lt;/GetFlightsResult&gt;\r\n    &lt;/GetFlightsResponse&gt;\r\n  &lt;/s:Body&gt;\r\n&lt;/s:Envelope&gt;</a></td></tr> </table></div></div>';}